In [14]:
import pandas as pd

In [16]:
weather_data={
    'day':['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temp':[32,35,36,37,32,35],
    'event':['rain','sunny','snow','rain','sunny','rain']
}
df=pd.DataFrame(weather_data)
df

        day  temp  event
0  1/1/2017    32   rain
1  1/2/2017    35  sunny
2  1/3/2017    36   snow
3  1/4/2017    37   rain
4  1/5/2017    32  sunny
5  1/6/2017    35   rain

In [18]:
df.shape

(6, 3)

print first 3 rows

In [24]:
df.head(3)

        day  temp  event
0  1/1/2017    32   rain
1  1/2/2017    35  sunny
2  1/3/2017    36   snow

print last 2 rows

In [26]:
df.tail(2)

        day  temp  event
4  1/5/2017    32  sunny
5  1/6/2017    35   rain

print 2nd,3rd,4th rows

In [28]:
df[2:5]

        day  temp  event
2  1/3/2017    36   snow
3  1/4/2017    37   rain
4  1/5/2017    32  sunny

#print coloumns

In [40]:
df.columns

Index(['day', 'temp', 'event'], dtype='object')

In [42]:
df['event']

0     rain
1    sunny
2     snow
3     rain
4    sunny
5     rain
Name: event, dtype: object

In [44]:
df['temp'].max()

37

In [46]:
df.describe()

            temp
count   6.000000
mean   34.500000
std     2.073644
min    32.000000
25%    32.750000
50%    35.000000
75%    35.750000
max    37.000000

In [48]:
df[df.temp>=32]

        day  temp  event
0  1/1/2017    32   rain
1  1/2/2017    35  sunny
2  1/3/2017    36   snow
3  1/4/2017    37   rain
4  1/5/2017    32  sunny
5  1/6/2017    35   rain

#to set index

In [56]:
df.set_index('day',inplace=True)

In [58]:
df

          temp  event
day
1/1/2017    32   rain
1/2/2017    35  sunny
1/3/2017    36   snow
1/4/2017    37   rain
1/5/2017    32  sunny
1/6/2017    35   rain

In [66]:
df.loc['1/2/2017']

temp        35
event    sunny
Name: 1/2/2017, dtype: object

#list

In [73]:
country=["USA","Mexico","Canada","Brazil"]
cost=[5000,4500,4000,3000]

In [85]:
sales=pd.Series(cost,index=country)
sales

USA       5000
Mexico    4500
Canada    4000
Brazil    3000
dtype: int64

In [101]:
mydict={'name':['dan','lucus','dilna','Aamy'],'age':[24,25,26,27],'salary':[6000,5500,5000,6400]}

In [103]:
Emp=pd.DataFrame(mydict)
Emp

    name  age  salary
0    dan   24    6000
1  lucus   25    5500
2  dilna   26    5000
3   Aamy   27    6400

In [105]:
print(Emp)

    name  age  salary
0    dan   24    6000
1  lucus   25    5500
2  dilna   26    5000
3   Aamy   27    6400

#how to isert coloum and rows

In [116]:
columnData=['ID','Emp','Salary','Exp']
df=pd.DataFrame(columns=columnData)
df

Empty DataFrame
Columns: [ID, Emp, Salary, Exp]
Index: []

In [134]:

df = pd.concat([df, pd.DataFrame([{'ID': 101, 'Emp': 'Daniel', 'Salary': 3000, 'Exp': 3}])], ignore_index=True)
df

    ID     Emp Salary Exp
0  101  Daniel   3000   3

In [136]:
df = pd.concat([df, pd.DataFrame([{'ID': 102, 'Emp': 'jack', 'Salary': 4000, 'Exp': 4}])], ignore_index=True)
df

    ID     Emp Salary Exp
0  101  Daniel   3000   3
1  102    jack   4000   4

In [138]:
df = pd.concat([df, pd.DataFrame([{'ID': 103, 'Emp': 'jacky', 'Salary': 5000, 'Exp': 4}])], ignore_index=True)
df

    ID     Emp Salary Exp
0  101  Daniel   3000   3
1  102    jack   4000   4
2  103   jacky   5000   4